<script setup lang="ts"></script>

<template>
  <svg
    data-name="Слой 1"
    id="Слой_1"
    viewBox="0 0 465.46 78.76"
    xmlns="http://www.w3.org/2000/svg"
    xmlns:xlink="http://www.w3.org/1999/xlink"
  >
    <defs>
      <linearGradient
        gradientTransform="matrix(1, 0, 0, -1, 0, -10969.43)"
        gradientUnits="userSpaceOnUse"
        id="Безымянный_градиент_4"
        x1="13.3"
        x2="13.3"
        y1="-11009.59"
        y2="-10969.88"
      >
        <stop offset="0" stop-color="#00a4ff" />
        <stop offset="1" stop-color="#142163" />
      </linearGradient>
      <linearGradient
        id="Безымянный_градиент_4-2"
        x1="39.42"
        x2="78.46"
        xlink:href="#Безымянный_градиент_4"
        y1="-10982.73"
        y2="-10982.73"
      />
      <linearGradient
        id="Безымянный_градиент_4-3"
        x1="65.7"
        x2="66.29"
        xlink:href="#Безымянный_градиент_4"
        y1="-11008.48"
        y2="-11048.84"
      />
      <linearGradient
        id="Безымянный_градиент_4-4"
        x1="39.57"
        x2="0.07"
        xlink:href="#Безымянный_градиент_4"
        y1="-11034.93"
        y2="-11034.93"
      />
    </defs>
    <title>logo new-2</title>
    <path
      class="cls-1"
      d="M16.46,52.23l-.11-.2h0A26.23,26.23,0,0,1,26.6,16.46L19.94,6.51a32,32,0,0,0-7.56,5.85A38.22,38.22,0,0,0,6,58H6a5.95,5.95,0,0,1-1,7.16l-5,5,8.43,8.43,5.2-5.22a18,18,0,0,0,2.71-3.59,17.93,17.93,0,0,0,.12-17.59Z"
    />
    <path
      class="cls-2"
      d="M66.57,12.38A38.22,38.22,0,0,0,21,6h0a6,6,0,0,1-7.23-1l-5-5L.3,8.43l5.22,5.2A17.86,17.86,0,0,0,18,18.71a17.84,17.84,0,0,0,8.89-2.36h0A26.23,26.23,0,0,1,62.46,26.6L72.6,20.22A34.35,34.35,0,0,0,66.57,12.38Z"
    />
    <path
      class="cls-3"
      d="M66.58,66.49a38.22,38.22,0,0,0,6.35-45.6h0a6,6,0,0,1,1-7.2l5-5L70.53.22l-5.2,5.22a17.93,17.93,0,0,0-2.72,21.39h0A26.23,26.23,0,0,1,52.37,62.38l6.86,9.85A30.6,30.6,0,0,0,66.58,66.49Z"
    />
    <path
      class="cls-4"
      d="M73.48,65.16a17.93,17.93,0,0,0-21.39-2.72h0A26.34,26.34,0,0,1,16.46,52.23h0a17.93,17.93,0,0,1-.12,17.59A38.24,38.24,0,0,0,58,72.76h0a6,6,0,0,1,7.2,1l5,5,8.43-8.43Z"
    />
  </svg>
</template>

<style scoped>
.cls-1 {
  fill: url(#Безымянный_градиент_4);
}
.cls-2 {
  fill: url(#Безымянный_градиент_4-2);
}
.cls-3 {
  fill: url(#Безымянный_градиент_4-3);
}
.cls-4 {
  fill: url(#Безымянный_градиент_4-4);
}
</style>
